x=0
y=0

def setup():
    size(380,600)
def draw():
    global y,x
    background(255,255,255)
    fill(31,130,203)#цвет корпуса
    rect(90,100,200,450)#корпус
    fill(18,109,198)#2 часть
    rect(125,100,130,450)#
    fill(31,130,203)
    rect(85,160,5,50)
    fill(2,36,70)
    ellipse(190,170,110,110)
    fill(0,0,0)
    ellipse(190,170,90,90)
    fill(7,15,57)
    rect(147,145,85,50)
    fill(13,14,21)
    ellipse(165,160,20,20)
    fill(251,255,198)
    ellipse(165,160,10,10)
    fill(13,14,21)
    ellipse(215,160,20,20)
    fill(17,82,46)
    ellipse(215,160,10,10)
    fill(0,0,0)
    ellipse(215,160,5,5)
    fill(148,198,170)
    ellipse(213,158,2,2)
    fill(148,198,170)
    ellipse(217,160,2,2)
    fill(4,10,41) # цвет камеры
    ellipse(165,185,20,20) # камера с лево внизу
    fill(7,72,23)#цвет блик
    ellipse(165,185,10,10)# блики
    fill(144,193,156) #цвет блик
    ellipse(165,185,5,5) #блики
    fill(4,10,41) # цвет камеры
    ellipse(215,185,20,20) # камера с право внизу
    fill(41,70,56) # цвет блик
    ellipse(215,185,10,10) # блики
    fill(110,111,110) # цвет блик
    ellipse(215,185,5,5) # блики
    fill(4,10,41) # цвет камеры
    ellipse(190,170,30,30) #камера по середине
    fill(15,52,34)# цвет блик
    ellipse(190,170,20,20)# блики
    fill(25,36,31)#цвет блик
    ellipse(190,170,10,10)#блики
    fill(240,250,245)#цвет блик
    ellipse(190,170,5,5)#блики
    translate(width/2, height/2)#надпись поко
    rotate(radians(-90))#надпись поко
    textSize(48)# надпись поко
    textAlign(CENTER, CENTER)#надпись поко
    text("POCO", 0, 0)#надпись поко
